ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000_temp/temperature_task.c
/**
****************************************************************************
* @file     temperature_task.c
* @author   ADI
* @version  V0.1
* @date     04-Dec-2019
* @brief    This is the source file used to measure temperature from adpd4100
****************************************************************************
* @attention
******************************************************************************
* Copyright (c) 2021 Analog Devices, Inc.  All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
* - Redistributions of source code must retain the above copyright notice, this
*   list of conditions and the following disclaimer.
* - Redistributions in binary form must reproduce the above copyright notice,
*   this list of conditions and the following disclaimer in the documentation
*   and/or other materials provided with the distribution.
* - Modified versions of the software must be conspicuously marked as such.
* - This software is licensed solely and exclusively for use with
*   processors/products manufactured by or for Analog Devices, Inc.
* - This software may not be combined or merged with other code in any manner
*   that would cause the software to become subject to terms and conditions
*   which differ from those listed here.
* - Neither the name of Analog Devices, Inc. nor the names of its contributors
*   may be used to endorse or promote products derived from this software
*   without specific prior written permission.
* - The use of this software may or may not infringe the patent rights of one
**   or more patent holders.  This license does not release you from the
*   requirement that you obtain separate licenses from these patent holders to
*   use this software.
*
* THIS SOFTWARE IS PROVIDED BY ANALOG DEVICES, INC. AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
* NONINFRINGEMENT, TITLE, MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL ANALOG DEVICES, INC. OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, PUNITIVE OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, DAMAGES ARISING OUT OF
* CLAIMS OF INTELLECTUAL PROPERTY RIGHTS INFRINGEMENT; PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
******************************************************************************/
#include <adpd4000_task.h>
volatile uint8_t gb_adpd_raw_start_temp = 1; /* Flag to handle whether ADPD sensor was 'start'ed to get raw data(CLI_USB/CLI_BLE) or if it was started by internal applications like Temp */
#ifdef ENABLE_TEMPERATURE_APP
/* -------------------------------- Includes -------------------------------- */
#ifdef EVTBOARD
#include <temperature_task.h>
#include "adpd400x_reg.h"
#include <tempr_lcfg.h>
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

/* ---------------------------- Defines -------------------------------------- */
#define   CAL_RESISTANCE            100000.0f   /*!< Calibration resistance value */
#define   ADC_DARK_OFFSET           0x2010u     /*!< output of ADC of ADPD4k when no pulse vtg is applied */
#define   THERM_SENSITIVITY         4400u       /*!< 4.4k for every degree Celsius change in temperature */
#define   THERM_RESISTANCE_AT_25    100000u     /*!< 100k @ 25 degree Celsius */
#define   REFERENCE_TEMPERATURE     25          /*!< Reference Temperature value */
#define   ADC_RESOLUTION            1.02f       /*!< ADC resolution in terms of nA/LSB for the given configuration */
#define   TEMPERATURE_APP_ROUTING_TBL_SZ (sizeof(temperature_app_routing_table) / sizeof(temperature_app_routing_table[0]))


#define LUT_METHOD      /*!< macro for enabling the LUT based temperature calculation */
#define LUT_STEP_CNT    21u /*!< number of entries in LUT */
#define LUT_STEP_SIZE    5u /*!< LUT step size */

/*--------------------------- Typedef ----------------------------------------*/
typedef  m2m2_hdr_t*(app_cb_function_t)(m2m2_hdr_t*);

/*! The dictionary type for mapping addresses to callback handlers */
typedef struct _app_routing_table_entry_t {
  uint8_t                    command;      /*!< command for the application */
  app_cb_function_t          *cb_handler;  /*!< function for the above command */
}app_routing_table_entry_t;

/*------------------------------ Public Variable -----------------------------*/
/*! structure to hold the lcfg which is currently being used
    It could be the default lcfg or from the temperature lcfg dcb */
temperature_lcfg_t active_temperature_lcfg = {0}; 

/*! structure to store temperature slots info*/
tempr_slot_info_t tempr_slot_info[SLOT_NUM];

#ifdef DEBUG_PKT
uint32_t g_temp_pkt_cnt = 0;
#endif
/*! Look up table for thermistor's resistance based on beta value for
  temperature ranging from 0 to 100 degree celcius in steps of 5 degree celcius*/

uint32_t aTemp_LUT[LUT_STEP_CNT] = {  355600, 271800, 209400, 162500, 127000,
                                      100000, 79230,  63180,  50680,  40900,
                                      33190,  27090,  22220,  18320,  15180,
                                      12640,  10580,  8887,   7500,   6357,
                                      5410
                                   };
extern g_state_t g_state;
extern slot_led_reg_t led_reg;
extern uint8_t gsOneTimeValueWhenReadAdpdData;
extern uint32_t gsTempSampleCount;
extern adpd400xDrv_slot_t gsSlot[SLOT_NUM];
extern uint16_t g_adpd_odr;
extern const temperature_lcfg_t tempr_default_lcfg;
/*------------------------------ Public Function Prototype ------------------ */
extern void temperatureAppData (uint32_t *pData, uint8_t slot_index);
extern uint16_t get_adpd_odr();
extern void enable_ext_syncmode();
extern void disable_ext_syncmode();
extern void enable_adpd_ext_trigger();
extern void disable_adpd_ext_trigger();
/*---------------------- Private variables -----------------------------------*/

