ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000_temp/temperature_task.c
/* Create the stack for task */
uint8_t temperature_app_task_stack[APP_OS_CFG_TEMPERATURE_APP_TASK_STK_SIZE];

/* Create handler for task */
ADI_OSAL_THREAD_HANDLE temperature_app_task_handler;

/* Create task attributes variable */
ADI_OSAL_STATIC_THREAD_ATTR temperature_app_task_attributes;

/* Create TCB for task */
StaticTask_t temperature_app_task_tcb;

/* Create semaphores */
ADI_OSAL_SEM_HANDLE   temperature_app_task_evt_sem;

/* Create Queue Handler for task */
ADI_OSAL_QUEUE_HANDLE  temperature_app_task_msg_queue = NULL;

/* TEMPERATURE VERSION STRING variable*/
const char GIT_TEMPERATURE_VERSION[] = "TEST TEMPERATURE_VERSION STRING";

/* TEMPERATURE VERSION STRING size variable*/
const uint8_t GIT_TEMPERATURE_VERSION_LEN = sizeof(GIT_TEMPERATURE_VERSION);

/* Variable used for storing the pulse voltage applied*/
static volatile float gsPulseVtg = 0;

/* Variable used for storing the resistance measured */
static volatile float gsResistance= 0;

#ifdef LUT_METHOD
/* Variable used for storing the resistance value change per degree celcius*/
static volatile uint32_t gsDeltaResistance;
#endif
static uint16_t g_reg_base;

#ifdef SLOT_SELECT
bool check_temp_slot_set = false;
#endif
/* Variable used for storing the temperature stream subscriber and sequence count */
static uint16_t gsTemperatureSubscribers, gsTemperatureSeqNum;
/* Variable for counting the number of stream start requests*/
uint16_t gsTemperatureStarts;

/* Variables for storing the adpd4k value for thermistor and cal-resistor slots */
static uint32_t gsThermValue = 0, gsCalResValue = 0;

/*
  Each bit of this variable inidcates the presence/absence of thermistor in a given slot
  0th bit - slot A; 1st bit - slot B and so on till slot L
  1 - Thermistor is connected to the slot
  0 - No thermistor is connected the slot 
*/
uint32_t g_therm_slot_en_bit_mask = 0;

/* Variable to indicate the last thermistor slot selected */
uint8_t g_last_thermistor_slot_index = 0;

/* Array to store the thermistor's ADC values read from ADPD4K */
static uint32_t thermistor_adc_val[SLOT_NUM];

/* Variable to count the number of samples from ADPD4K */
uint32_t num_thermistor_samples = 0;

extern adpd400xDrv_slot_t gsSlot[SLOT_NUM];

/*------------------------ Private Function Prototype -----------------------*/
static m2m2_hdr_t *temperature_app_stream_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *temperature_app_status(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adpd_app_get_dcfg(m2m2_hdr_t *p_pkt);
static void temperature_app_task(void *pArgument);
static void fetch_temperature_data();

/* Table which maps commands to the callback functions */
app_routing_table_entry_t temperature_app_routing_table[] = {
  {M2M2_APP_COMMON_CMD_STREAM_START_REQ, temperature_app_stream_config},
  {M2M2_APP_COMMON_CMD_STREAM_STOP_REQ, temperature_app_stream_config},
  {M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_REQ, temperature_app_stream_config},
  {M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_REQ, temperature_app_stream_config},
  {M2M2_APP_COMMON_CMD_SENSOR_STATUS_QUERY_REQ, temperature_app_status},
  {M2M2_SENSOR_COMMON_CMD_GET_DCFG_REQ, adpd_app_get_dcfg},
  {M2M2_APP_COMMON_CMD_READ_LCFG_REQ, temperature_app_lcfg_access},
  {M2M2_APP_COMMON_CMD_WRITE_LCFG_REQ, temperature_app_lcfg_access},
#ifdef DCB
    {M2M2_APP_COMMON_CMD_SET_LCFG_REQ, tempr_app_set_dcb_lcfg},
    {M2M2_DCB_COMMAND_READ_CONFIG_REQ, tempr_dcb_command_read_config},
    {M2M2_DCB_COMMAND_WRITE_CONFIG_REQ, tempr_dcb_command_write_config},
    {M2M2_DCB_COMMAND_ERASE_CONFIG_REQ, tempr_dcb_command_delete_config},
#endif
};

#ifdef USER0_CONFIG_APP
#include "user0_config_app_task.h"
#include "app_timer.h"
#include "low_touch_task.h"
APP_TIMER_DEF(m_temp_timer_id);     /**< Handler for repeated timer for temp. */
static void temp_timer_start(void);
static void temp_timer_stop(void);
static void temp_timeout_handler(void * p_context);
void start_temp_app_timer();
user0_config_app_timing_params_t temp_app_timings = {0};
#endif


/*!***********************************************************************************
* \brief      Get the slot index of the last thermistor/cal resistor slot enabled
*             This will be used to identify one complete cycle of ADC measurement for
*             different thermistors connected to ADPD4K
*
* \param[in]  None
*
* \return     returns slot index of the last thermistor/cal resistor slot enabled
**************************************************************************************/
uint8_t get_last_thermistor_slot_index_enabled(void)
{
  uint8_t i = 0;
  for( i=(SLOT_NUM-1); i>=0; i--)
  {
    if(active_temperature_lcfg.slots_selected & ( 1 << i))
    {
        return i;
    }

  }
}

/*!****************************************************************************
 * \brief Get ADPD4k DCFG
 *
 * \param[in]           p_pkt: input m2m2 packet
 *
 * \return              pointer to reponse m2m2 packet
 *****************************************************************************/
static m2m2_hdr_t *adpd_app_get_dcfg(m2m2_hdr_t *p_pkt) {
    uint16_t dcfg_size;
    uint16_t i = 0, num_pkts = 0, dcfg_array_index = 0;
    uint32_t  dcfgdata[MAXADPD4000DCBSIZE*MAX_ADPD4000_DCB_PKTS];
    ADI_OSAL_STATUS  err;
    M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;

  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_sensor_dcfg_data_t, 0);

  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_sensor_dcfg_data_t, p_resp_payload);
    memset(dcfgdata, 0,sizeof(dcfgdata));
    memset(p_resp_payload->dcfgdata, 0, sizeof(p_resp_payload->dcfgdata));
    if (ADPD4000_DCFG_STATUS_OK == read_adpd4000_dcfg(&dcfgdata[0], &dcfg_size)) { // dcfg size will give number of registers
      status = M2M2_APP_COMMON_STATUS_OK;
      num_pkts = (dcfg_size / MAXADPD4000DCBSIZE) + ((dcfg_size % MAXADPD4000DCBSIZE) ? 1 : 0 );
      dcfg_array_index = 0;
      for(uint16_t p = 0; p < num_pkts; p++) {
         p_resp_payload->size = \
              (p != num_pkts-1) ? MAXADPD4000DCBSIZE : (dcfg_size % MAXADPD4000DCBSIZE);
         p_resp_payload->num_tx_pkts = num_pkts;
         for (i = 0; i < p_resp_payload->size; i++) {
            p_resp_payload->dcfgdata[i] = dcfgdata[dcfg_array_index++];
         }
         if(p != num_pkts-1) {
           p_resp_pkt->src = p_pkt->dest;
           p_resp_pkt->dest = p_pkt->src;
           p_resp_payload->status = status;
           p_resp_payload->command = M2M2_SENSOR_COMMON_CMD_GET_DCFG_RESP;
           post_office_send(p_resp_pkt, &err);

           /* Delay is kept same as what is there in low touch task */
           MCU_HAL_Delay(60);

