ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000_temp/temperature_task.c
           PKT_MALLOC(p_resp_pkt, m2m2_sensor_dcfg_data_t, 0);
           if(NULL != p_resp_pkt) {
             // Declare a pointer to the response packet payload
             PYLD_CST(p_resp_pkt, m2m2_sensor_dcfg_data_t, p_resp_payload);
             memset(p_resp_payload->dcfgdata, 0, sizeof(p_resp_payload->dcfgdata));
           }//if(NULL != p_resp_pkt)
           else {
             return NULL;
           }
         }
       }
      }else {
        p_resp_payload->size = 0;
        p_resp_payload->num_tx_pkts = 0;
        status = M2M2_APP_COMMON_STATUS_ERROR;
      }//if(read_adpd4000_dcfg())
    p_resp_payload->status = status;
    p_resp_payload->command = M2M2_SENSOR_COMMON_CMD_GET_DCFG_RESP;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }//if(NULL != p_resp_pkt)
  return p_resp_pkt;
}

/*!****************************************************************************
* \brief  Returns the Temperature stream status
*
* \param[in]  p_pkt: Pointer to the input m2m2 packet structure
*
* \return     p_resp_pkt: Pointer to the output response m2m2 packet structure
*/
static m2m2_hdr_t *temperature_app_status(m2m2_hdr_t *p_pkt) {
  /* Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, m2m2_app_common_status_t, p_in_payload);
  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_app_common_status_t, 0);
  if(NULL != p_resp_pkt)
  {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_app_common_status_t, p_resp_payload);

    p_resp_payload->command = M2M2_APP_COMMON_CMD_SENSOR_STATUS_QUERY_RESP;
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;

    if (g_state.num_starts == 0) {
      p_resp_payload->status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
    } else {
      p_resp_payload->status = M2M2_APP_COMMON_STATUS_STREAM_STARTED;
    }
    uint8_t slot_num;
    slot_num = p_in_payload->stream - M2M2_ADDR_MED_TEMPERATURE_STREAM1;    
    p_resp_payload->stream = p_in_payload->stream;
    p_resp_payload->num_subscribers = tempr_slot_info[slot_num].num_subs;
    p_resp_payload->num_start_reqs = gsTemperatureStarts;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/*!****************************************************************************
* \brief  Handles start/stop/sub/unsub of temperature data streams commands
*
* \param[in]  p_pkt: Pointer to the input m2m2 packet structure with command
*                    for stream start/stop/sub/unsub operations
*
* \return     p_resp_pkt: Pointer to the output response m2m2 packet structure
*/
static m2m2_hdr_t *temperature_app_stream_config(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  M2M2_APP_COMMON_CMD_ENUM_t    command;
  /*Keeping nRetCode as success by default, to handle else part
    of if(!temp_app_timings.delayed_start) */
  int16_t nRetCode = ADPD400xDrv_SUCCESS;
  uint8_t slot_num;
  /* Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, m2m2_app_common_sub_op_t, p_in_payload);
  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_app_common_sub_op_t, 0);
  if(NULL != p_resp_pkt)
  {
  /* Declare a pointer to the response packet payload */
  PYLD_CST(p_resp_pkt, m2m2_app_common_sub_op_t, p_resp_payload);

  switch (p_in_payload->command) {
  case M2M2_APP_COMMON_CMD_STREAM_START_REQ:
    if (g_state.num_starts == 0) {
/*        //load_temperature_dcfg();
        //Adpd400xDrvSlotSetup(4,1,0x0004,1);
      //reset_adpd_packetization(); */
#ifndef SLOT_SELECT
  for(uint8_t i=0 ; i<SLOT_NUM ; i++)
  {
    g_reg_base = i * 0x20;
    if(Adpd400xDrvRegRead(ADPD400x_REG_LED_POW12_A + g_reg_base, &led_reg.reg_val[i].reg_pow12) == ADPD400xDrv_SUCCESS)
      {
      Adpd400xDrvRegWrite(ADPD400x_REG_LED_POW12_A + g_reg_base, 0x0);
      }/* disable led for slot-A - I */

     if(Adpd400xDrvRegRead(ADPD400x_REG_LED_POW34_A + g_reg_base, &led_reg.reg_val[i].reg_pow34) == ADPD400xDrv_SUCCESS)
      {
      Adpd400xDrvRegWrite(ADPD400x_REG_LED_POW34_A + g_reg_base, 0x0);
      }/* disable led for slot-> A - I */
   }
#endif
      g_adpd_odr = get_adpd_odr();
      enable_ext_syncmode();
      enable_adpd_ext_trigger(g_adpd_odr);

      gsOneTimeValueWhenReadAdpdData = 0;
#ifdef USER0_CONFIG_APP
      get_temp_app_timings_from_user0_config_app_lcfg(&temp_app_timings.start_time,\
                                      &temp_app_timings.on_time, &temp_app_timings.off_time);
      if(temp_app_timings.start_time > 0)
      {
        temp_app_timings.delayed_start = true;
      }
#ifdef LOW_TOUCH_FEATURE
      //Temp app not in continuous mode & its interval operation mode
      if(!is_temp_app_mode_continuous() && !(get_low_touch_trigger_mode3_status()))
#else
      //Temp app not in continuous mode
      if(!is_temp_app_mode_continuous())
#endif
      {
        start_temp_app_timer();
      }

      if(!temp_app_timings.delayed_start)
      {
        nRetCode = Adpd400xDrvSetOperationMode(ADPD400xDrv_MODE_SAMPLE);
        temp_app_timings.app_mode_on = true;
      }
      if(ADPD400xDrv_SUCCESS == nRetCode)
#else
      if(ADPD400xDrv_SUCCESS == Adpd400xDrvSetOperationMode(ADPD400xDrv_MODE_SAMPLE))
#endif// USER0_CONFIG_APP

      {
        g_state.num_starts = 1;
        gb_adpd_raw_start_temp = 0;
        gsTemperatureStarts = 1;
        num_thermistor_samples = 0;
        g_last_thermistor_slot_index = get_last_thermistor_slot_index_enabled();
#ifdef CUST4_SM
        gsTempSampleCount = (gsSlot[ADPD400xDrv_SLOTD].odr - 1);
#else
        gsTempSampleCount = 0;
#endif
        status = M2M2_APP_COMMON_STATUS_STREAM_STARTED;
      }
      else
      {
        status = M2M2_APP_COMMON_STATUS_STREAM_NOT_STARTED;
      }

    } else {
      g_state.num_starts++;
      gb_adpd_raw_start_temp = 0;
      gsTemperatureStarts++;
      g_last_thermistor_slot_index = get_last_thermistor_slot_index_enabled();
      if(gsTemperatureStarts == 1)
      {
#ifdef CUST4_SM
      gsTempSampleCount = (gsSlot[ADPD400xDrv_SLOTD].odr - 1);
#else
      gsTempSampleCount = 0;
#endif
      status = M2M2_APP_COMMON_STATUS_STREAM_STARTED;
#ifdef USER0_CONFIG_APP
      get_temp_app_timings_from_user0_config_app_lcfg(&temp_app_timings.start_time,\
                                      &temp_app_timings.on_time, &temp_app_timings.off_time);
      if(temp_app_timings.start_time > 0)
      {
        temp_app_timings.delayed_start = true;
      }

#ifdef LOW_TOUCH_FEATURE
      //Temp app not in continuous mode & its interval operation mode
      if(!is_temp_app_mode_continuous() && !(get_low_touch_trigger_mode3_status()))
#else
      //Temp app not in continuous mode
      if(!is_temp_app_mode_continuous())
#endif
      {
        start_temp_app_timer();
      }

      if(!temp_app_timings.delayed_start)
      {
        temp_app_timings.app_mode_on = true;
        ;//TODO: Check and handle ADPD sample mode/idle mode switching
      }
#endif// USER0_CONFIG_APP
      }
      else
      {
      status = M2M2_APP_COMMON_STATUS_STREAM_IN_PROGRESS;
      }
    }
    command = M2M2_APP_COMMON_CMD_STREAM_START_RESP;
    break;
  case M2M2_APP_COMMON_CMD_STREAM_STOP_REQ:
    if (g_state.num_starts == 0) {
      status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
    } else if (g_state.num_starts == 1) {

      gsOneTimeValueWhenReadAdpdData = 0;
      disable_ext_syncmode();  /*! Disable ext sync mode*/
      g_adpd_odr = get_adpd_odr();
      disable_adpd_ext_trigger(g_adpd_odr);
      if (ADPD400xDrv_SUCCESS == Adpd400xDrvSetOperationMode(ADPD400xDrv_MODE_IDLE)) {
        g_state.num_starts = 0;
        gb_adpd_raw_start_temp = 1;
        gsTemperatureStarts = 0;
        gsTempSampleCount = 0;
        status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
        /* reset_adpd_packetization();*/
#ifdef USER0_CONFIG_APP
        if(temp_app_timings.check_timer_started)
        {
          temp_timer_stop();
          temp_app_timings.on_time_count = 0;
          temp_app_timings.off_time_count = 0;
          temp_app_timings.start_time_count = 0;
          temp_app_timings.delayed_start =  false;
        }
#endif//USER0_CONFIG_APP
      } else {
        g_state.num_starts = 1;
        gb_adpd_raw_start_temp = 1;
        gsTemperatureStarts = 1;
        status = M2M2_APP_COMMON_STATUS_ERROR;
      }
#ifndef SLOT_SELECT
  for(uint8_t i=0 ; i<SLOT_NUM ; i++)
  {
    g_reg_base = i * 0x20;
    Adpd400xDrvRegWrite(ADPD400x_REG_LED_POW12_A + g_reg_base, led_reg.reg_val[i].reg_pow12); /* enable led */
    Adpd400xDrvRegWrite(ADPD400x_REG_LED_POW34_A + g_reg_base, led_reg.reg_val[i].reg_pow34);
  }
#endif
    } else {
      g_state.num_starts--;
      gsTemperatureStarts--;
      if(gsTemperatureStarts == 0)
      {
      gb_adpd_raw_start_temp = 1;
      gsTempSampleCount = 0;
      status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
      }
      else
      {
      status = M2M2_APP_COMMON_STATUS_STREAM_COUNT_DECREMENT;
      }
    }
    command = M2M2_APP_COMMON_CMD_STREAM_STOP_RESP;
    break;
  case M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_REQ:
    gsTemperatureSubscribers++;
    if(gsTemperatureSubscribers == 1)
    {
      /* reset pkt sequence no. only during 1st sub request */
      gsTemperatureSeqNum = 0;
    }

    if(p_in_payload->stream == M2M2_ADDR_MED_TEMPERATURE_STREAM || p_in_payload->stream == M2M2_ADDR_MED_TEMPERATURE_STREAM4)
    {
        slot_num = E_THERMISTOR_SLOT_D;
        post_office_setup_subscriber(
            M2M2_ADDR_MED_TEMPERATURE, M2M2_ADDR_MED_TEMPERATURE_STREAM, p_pkt->src, true);

