ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000_temp/temperature_task.c
    }
    else
    {
        slot_num = p_in_payload->stream - M2M2_ADDR_MED_TEMPERATURE_STREAM1;
        post_office_setup_subscriber(
            M2M2_ADDR_MED_TEMPERATURE, p_in_payload->stream, p_pkt->src, true);
    }
    
    tempr_slot_info[slot_num].num_subs++;
    if (tempr_slot_info[slot_num].num_subs == 1)
      tempr_slot_info[slot_num].seq_num = 0;

#ifdef SLOT_SELECT
    if(check_temp_slot_set == false)
    {
      g_therm_slot_en_bit_mask = 0x18; /* slot-D & E */
    }
    else
    {
    check_temp_slot_set = false;
    }
#else
      g_therm_slot_en_bit_mask = active_temperature_lcfg.slots_selected;
#endif
    /* post_office_setup_subscriber(M2M2_ADDR_SENSOR_ADPD, M2M2_ADDR_SENSOR_ADPD_STREAM, p_pkt->src, true); */
//    post_office_setup_subscriber(M2M2_ADDR_MED_TEMPERATURE,M2M2_ADDR_MED_TEMPERATURE_STREAM, p_pkt->src, true);
    status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_ADDED;
    command = M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_RESP;
    break;
  case M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_REQ:
    if (gsTemperatureSubscribers <= 1) {
      gsTemperatureSubscribers = 0;
      g_therm_slot_en_bit_mask = 0;
//      status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_REMOVED;
    } else {
      gsTemperatureSubscribers--;
//      status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_COUNT_DECREMENT;
    }

    if(p_in_payload->stream == M2M2_ADDR_MED_TEMPERATURE_STREAM || p_in_payload->stream == M2M2_ADDR_MED_TEMPERATURE_STREAM4)
    {
        slot_num = E_THERMISTOR_SLOT_D;
        post_office_setup_subscriber(M2M2_ADDR_MED_TEMPERATURE, M2M2_ADDR_MED_TEMPERATURE_STREAM, p_pkt->src, false);
    }
    else
    {
        slot_num = p_in_payload->stream - M2M2_ADDR_MED_TEMPERATURE_STREAM1;    
        post_office_setup_subscriber(M2M2_ADDR_MED_TEMPERATURE, p_in_payload->stream, p_pkt->src, false);
    }

    if (tempr_slot_info[slot_num].num_subs <= 1)
    {
      tempr_slot_info[slot_num].num_subs = 0;
      status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_REMOVED;
    }
    else
    {
      tempr_slot_info[slot_num].num_subs--;
      status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_COUNT_DECREMENT;
    }
    command = M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_RESP;
    break;
  default:
    post_office_consume_msg(p_resp_pkt);
    return NULL;
  }
  p_resp_payload->command = command;
  p_resp_payload->status = status;
  p_resp_payload->stream = p_in_payload->stream;
  p_resp_pkt->src = p_pkt->dest;
  p_resp_pkt->dest = p_pkt->src;
  }//if(NULL != p_resp_pkt)
  return p_resp_pkt;
}

#ifdef USER0_CONFIG_APP
/**@brief Function for the Timer initialization.
*
* @details Initializes the timer module. This creates and starts application timers.
*
* @param[in]  None
*
* @return     None
*/
static void temp_timer_init(void)
{
    ret_code_t err_code;

    /*! Create timers */
    err_code =  app_timer_create(&m_temp_timer_id, APP_TIMER_MODE_REPEATED, temp_timeout_handler);

    APP_ERROR_CHECK(err_code);
}

/**@brief   Function for starting application timers.
* @details Timers are run after the scheduler has started.
*
* @param[in]  None
*
* @return     None
*/
static void temp_timer_start(void)
{
    /*! Start repeated timer */
    ret_code_t err_code = app_timer_start(m_temp_timer_id, APP_TIMER_TICKS(TIMER_ONE_SEC_INTERVAL), NULL);
    APP_ERROR_CHECK(err_code);

    temp_app_timings.check_timer_started = true;
}

/**@brief   Function for stopping the application timers.
*
* @param[in]  None
*
* @return     None
*/
static void temp_timer_stop(void)
{
    /*! Stop the repeated timer */
    ret_code_t err_code = app_timer_stop(m_temp_timer_id);
    APP_ERROR_CHECK(err_code);

    temp_app_timings.check_timer_started = false;
}

/**@brief   Callback Function for application timer events
*
* @param[in]  p_context: pointer to the callback function arguments
*
* @return     None
*/
static void temp_timeout_handler(void * p_context)
{
    if(temp_app_timings.delayed_start && temp_app_timings.start_time>0)
    {
      temp_app_timings.start_time_count++; /*! Increment counter every sec., till it is equal to start_time Value in seconds. */
      if(temp_app_timings.start_time_count == temp_app_timings.start_time)
      {
#ifndef SLOT_SELECT
        //Check if ADPD is also started, if so turn LED off
        if (g_state.num_starts >= 1) {
          for(uint8_t i=0 ; i<SLOT_NUM ; i++)
          {
            g_reg_base = i * 0x20;
            if(Adpd400xDrvRegRead(ADPD400x_REG_LED_POW12_A + g_reg_base, &led_reg.reg_val[i].reg_pow12) == ADPD400xDrv_SUCCESS)
            {
              Adpd400xDrvRegWrite(ADPD400x_REG_LED_POW12_A + g_reg_base, 0x0);
            }/* disable led for slot-A - I */

             if(Adpd400xDrvRegRead(ADPD400x_REG_LED_POW34_A + g_reg_base, &led_reg.reg_val[i].reg_pow34) == ADPD400xDrv_SUCCESS)
             {
              Adpd400xDrvRegWrite(ADPD400x_REG_LED_POW34_A + g_reg_base, 0x0);
             }/* disable led for slot-> A - I */
          }
        }
#endif

        //TODO: Disable other slots except Slot D, E
        //delayed start time expired-turn ON ADPD
        if (ADPD400xDrv_SUCCESS == Adpd400xDrvSetOperationMode(ADPD400xDrv_MODE_SAMPLE))
        {
        }
        temp_app_timings.delayed_start = false;
        temp_app_timings.start_time_count = 0;
        temp_app_timings.app_mode_on = true;
      }
      return;
    }

    if(temp_app_timings.app_mode_on && temp_app_timings.on_time>0)
    {
        temp_app_timings.on_time_count++; /*! Increment counter every sec. incase of ADPD ON, till it is equal to Ton Value in seconds. */
        if(temp_app_timings.on_time_count == temp_app_timings.on_time)
        {
          //on timer expired - turn off ADPD
          if (g_state.num_starts >= 1) {
              if (ADPD400xDrv_SUCCESS == Adpd400xDrvSetOperationMode(ADPD400xDrv_MODE_IDLE)) {
              }
              //TODO: Enable other slots except Slot D, E, disable Slot D,E
          }
          temp_app_timings.app_mode_on = false;
          temp_app_timings.on_time_count = 0;
        }
    }
    else if(!temp_app_timings.app_mode_on && temp_app_timings.off_time>0)
    {
      temp_app_timings.off_time_count++; /*! Increment counter every sec. incase of ADPD OFF, till it is equal to Toff Value in seconds.*/
      if(temp_app_timings.off_time_count == temp_app_timings.off_time)
        {
           //off timer expired - turn on ADPD
           if (g_state.num_starts >= 1) {
               if (ADPD400xDrv_SUCCESS == Adpd400xDrvSetOperationMode(ADPD400xDrv_MODE_SAMPLE))
               {
               }
           }
           temp_app_timings.app_mode_on = true;
           temp_app_timings.off_time_count = 0;
        }
    }
}

/**@brief   Function to start Temp app timer
* @details  This is used in either interval based/intermittent LT mode3
*
* @param[in]  None
*
* @return     None
*/
void start_temp_app_timer()
{
  if(temp_app_timings.on_time > 0)
  {
    temp_timer_start();
  }
}
#endif//USER0_CONFIG_APP

/*!****************************************************************************
* \brief  Posts the message packet received into the Temperature task queue
*
* \param[in]  p_pkt: pointer to the message to be posted
*
* \return None
*/
void send_message_temperature_app_task(m2m2_hdr_t *p_pkt) {
  ADI_OSAL_STATUS osal_result;
  osal_result = adi_osal_MsgQueuePost(temperature_app_task_msg_queue,p_pkt);
  if (osal_result != ADI_OSAL_SUCCESS)
    post_office_consume_msg(p_pkt);
  adi_osal_SemPost(temperature_app_task_evt_sem);
}

/*!****************************************************************************
* \brief  Initializes the temperature task
*
* \param[in]  None
*
* \return     None
*
*/
void temperature_app_task_init(void) {
  ADI_OSAL_STATUS eOsStatus = ADI_OSAL_SUCCESS;
  temperature_app_task_attributes.pThreadFunc = temperature_app_task;
  temperature_app_task_attributes.nPriority = APP_OS_CFG_TEMPERATURE_APP_TASK_PRIO;
  temperature_app_task_attributes.pStackBase = &temperature_app_task_stack[0];
  temperature_app_task_attributes.nStackSize = APP_OS_CFG_TEMPERATURE_APP_TASK_STK_SIZE;
  temperature_app_task_attributes.pTaskAttrParam = NULL;
  temperature_app_task_attributes.szThreadName = "Temperature Sensor";
  temperature_app_task_attributes.pThreadTcb = &temperature_app_task_tcb;

