ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000_temp/temperature_task.c
  eOsStatus = adi_osal_MsgQueueCreate(&temperature_app_task_msg_queue,NULL,
                                    25);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
      Debug_Handler();
  }
  else
  {
    update_task_queue_list(APP_OS_CFG_TEMPERATURE_TASK_INDEX,temperature_app_task_msg_queue);
  }

  eOsStatus = adi_osal_ThreadCreateStatic(&temperature_app_task_handler,
                                    &temperature_app_task_attributes);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
      Debug_Handler();
  }

  adi_osal_SemCreate(&temperature_app_task_evt_sem, 0);
  
  for (uint8_t slot_num = 0; slot_num < SLOT_NUM; slot_num++) {
    if( slot_num == E_THERMISTOR_SLOT_D)
        post_office_add_mailbox(M2M2_ADDR_MED_TEMPERATURE, M2M2_ADDR_MED_TEMPERATURE_STREAM);
    else
        post_office_add_mailbox(M2M2_ADDR_MED_TEMPERATURE,
            (M2M2_ADDR_ENUM_t)(M2M2_ADDR_MED_TEMPERATURE_STREAM1 + slot_num));
  }

}

 /* Temperature sensor sampling period in terms of os ticks;
    free RTOS tick period is set to 1000ms or 1 Hz*/
/* uint32_t gsTempSampPeriod = 1000; */

/*!****************************************************************************
* \brief  Task which handles processing of the temperature data and commands received
*
* \param[in]  pArgument: input argument to the task
*
* \return None
*/
static void temperature_app_task(void *pArgument) {
  ADI_OSAL_STATUS         err;

#ifdef USER0_CONFIG_APP
  temp_timer_init();
#endif

  /*load the lcfg structure from dcb if present else copy the default lcfg*/
  if (tempr_get_dcb_present_flag() == true) {
    /*! dcb present, so read the lcfg from dcb and load the lcfg structure */
    load_tempr_lcfg_from_dcb();
  }
  else
  {
    /*! dcb not present, so load the lcfg structure with default values */
    memcpy((uint8_t *)&active_temperature_lcfg,(uint8_t *)&tempr_default_lcfg,sizeof(active_temperature_lcfg));
  }

  while (1)
  {
      m2m2_hdr_t *p_in_pkt = NULL;
      m2m2_hdr_t *p_out_pkt = NULL;
      adi_osal_SemPend(temperature_app_task_evt_sem, ADI_OSAL_TIMEOUT_FOREVER);
      p_in_pkt = post_office_get(ADI_OSAL_TIMEOUT_NONE, APP_OS_CFG_TEMPERATURE_TASK_INDEX);
      if (p_in_pkt == NULL) {
        /* No m2m2 messages to process, so fetch some data from the device. */
        fetch_temperature_data();
      } else {
        /* We got an m2m2 message from the queue, process it. */
       PYLD_CST(p_in_pkt, _m2m2_app_common_cmd_t, p_in_cmd);
       /* Look up the appropriate function to call in the function table */
        for (int i = 0; i < TEMPERATURE_APP_ROUTING_TBL_SZ; i++) {
          if (temperature_app_routing_table[i].command == p_in_cmd->command) {
            p_out_pkt = temperature_app_routing_table[i].cb_handler(p_in_pkt);
            break;
          }
        }
        post_office_consume_msg(p_in_pkt);
        if (p_out_pkt != NULL) {
          post_office_send(p_out_pkt, &err);
        }
      }
  }
}

/*!*****************************************************************************************
* \brief  Calculates the temperature value from the input data
*
* \param[in]  pTherm: pointer to the ADPD4K value obtained from thermistor slot
* \param[in]  pRefVal: pointer to the ADPD4K value obtained from refernce cal-resistor slot
*
* \return if SUCCESS : nTempResult - Temperature value computed
*         if FAILURE : -1
*******************************************************************************************/
#if 1
uint32_t getTemperature(uint8_t slot_index, uint8_t lut_index)
{
  uint32_t thermistor_val = 0, cal_res_val = 0;
  cal_res_val = thermistor_adc_val[E_CAL_RES_SLOT_E] - ADC_DARK_OFFSET;
  thermistor_val = thermistor_adc_val[slot_index] - ADC_DARK_OFFSET;
  /* Calculate the pulse volatge applied to cal-resistor and thermistor in nV */
  gsPulseVtg = (CAL_RESISTANCE * (ADC_RESOLUTION * cal_res_val));
  gsPulseVtg = gsPulseVtg/ADC_RESOLUTION;
  /*  Resistance in ohm as vtg is in nV and current is in nA */
  gsResistance = (gsPulseVtg / thermistor_val);

  uint8_t loopCnt = 0;
  uint32_t nDiffRes = 0, nDeltaResPerDegree = 0, nDeltaRes = 0,nTempResult = 0;
  
  while(loopCnt<LUT_STEP_CNT)
  {
    if(gsResistance <= active_temperature_lcfg.T_I_curve_LUT[lut_index][LUT_STEP_CNT-1])
    {
        /* return max_temperature_value that is 20*5 = 100 */
        return((LUT_STEP_CNT-1)*LUT_STEP_SIZE);
    }
    else if(gsResistance >= active_temperature_lcfg.T_I_curve_LUT[lut_index][0])
    {
         /* return the min temperature value that is zero */
        return(0);
    }
    else
    {
        /* calculate temperature value here */
        if(gsResistance < active_temperature_lcfg.T_I_curve_LUT[lut_index][loopCnt])
        {
          loopCnt++;
        }
        else
        {
          /* The highest Temperature range it belongs to */
          nTempResult = loopCnt * LUT_STEP_SIZE;
          /*Fine tune the Temperature value*/
          nDiffRes = active_temperature_lcfg.T_I_curve_LUT[lut_index][loopCnt-1] - active_temperature_lcfg.T_I_curve_LUT[lut_index][loopCnt];  /* Find the temperature difference in this resistance block */
          nDeltaResPerDegree = nDiffRes/LUT_STEP_SIZE;
          nDeltaRes = (uint32_t) gsResistance - active_temperature_lcfg.T_I_curve_LUT[lut_index][loopCnt];
          nTempResult = (nTempResult * TEMPERATURE_SCALING_FACTOR) - ((nDeltaRes * TEMPERATURE_SCALING_FACTOR)/nDeltaResPerDegree); /* Fine tuned the temperature value */
          if(nTempResult >= TEMPERATURE_MAX_VALUE)
            nTempResult = TEMPERATURE_MAX_VALUE;
          return(nTempResult);
        }
    }
  }
}
#else
uint32_t getTemperature(uint32_t *pTherm, uint32_t *pRefVal)
{

  *pTherm = *pTherm - ADC_DARK_OFFSET;
  *pRefVal =  *pRefVal - ADC_DARK_OFFSET;
  /* Calculate the pulse volatge applied to cal-resistor and thermistor in nV */
  gsPulseVtg = (CAL_RESISTANCE * (ADC_RESOLUTION * *pRefVal));
  gsPulseVtg = gsPulseVtg/ADC_RESOLUTION;
  /*  Resistance in ohm as vtg is in nV and current is in nA */
  gsResistance = (gsPulseVtg / *pTherm);
  uint8_t loopCnt = 0;
  uint32_t nDiffRes = 0, nDeltaResPerDegree = 0, nDeltaRes = 0,nTempResult = 0;
#ifdef LUT_METHOD

  while(loopCnt<LUT_STEP_CNT)
  {
    if(gsResistance <= aTemp_LUT[LUT_STEP_CNT-1])
    {
        /* return max_temperature_value that is 20*5 = 100 */
        return((LUT_STEP_CNT-1)*LUT_STEP_SIZE);
    }
    else if(gsResistance >= aTemp_LUT[0])
    {
         /* return the min temperature value that is zero */
        return(0);
    }
    else
    {
        /* calculate temperature value here */
        if(gsResistance < aTemp_LUT[loopCnt])
        {
          loopCnt++;
        }
        else
        {
          /* The highest Temperature range it belongs to */
          nTempResult = loopCnt * LUT_STEP_SIZE;
          /*Fine tune the Temperature value*/
          nDiffRes = aTemp_LUT[loopCnt-1] - aTemp_LUT[loopCnt];  /* Find the temperature difference in this resistance block */
          nDeltaResPerDegree = nDiffRes/LUT_STEP_SIZE;
          nDeltaRes = (uint32_t) gsResistance - aTemp_LUT[loopCnt];
          nTempResult = (nTempResult * 10) - ((nDeltaRes * 10)/nDeltaResPerDegree); /* Fine tuned the temperature value */
          return(nTempResult);
        }
    }
  }
return -1;
#else
  if (gsResistance > THERM_RESISTANCE_AT_25)
  {
    /* indicates decrease in temperateure as NTC is used*/
    gsDeltaResistance = ((uint32_t)gsResistance - THERM_RESISTANCE_AT_25);
    gsDeltaResistance = gsDeltaResistance/THERM_SENSITIVITY;
    return (REFERENCE_TEMPERATURE - gsDeltaResistance);            /*25 is the reference temperature */
  }
  else
  {
    /* indicates increase in temperateure as NTC is used*/
    gsDeltaResistance = (THERM_RESISTANCE_AT_25 - (uint32_t)gsResistance);
    gsDeltaResistance = gsDeltaResistance/THERM_SENSITIVITY;
    return (REFERENCE_TEMPERATURE + gsDeltaResistance);            /*25 is the reference temperature*/
  }
#endif /*LUT_METHOD */
}
#endif

/*!****************************************************************************
* \brief  Computes the temperature data and does the data packetization
*
* \param[in]  None
*
* \return     None
*******************************************************************************/
void fetch_temperature_data()
{
  m2m2_hdr_t *p_pkt = NULL;
  ADI_OSAL_STATUS         err;
  temperature_app_stream_t resp_temperature;

#ifdef USER0_CONFIG_APP
  if(temp_app_timings.app_mode_on)
  {
#endif //USER0_CONFIG_APP
  if(gsTemperatureSubscribers > 0)
  {
    uint8_t lut_index = 0;
    for(uint8_t s_index = 0; s_index < SLOT_NUM; s_index++)
    {
      if((active_temperature_lcfg.slots_selected & (1 << s_index)) && s_index != E_CAL_RES_SLOT_E)
      {
        if(tempr_slot_info[s_index].num_subs != 0) /* Check if the stream is subscribed*/
        {
          resp_temperature.command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_SENSOR_COMMON_CMD_STREAM_DATA;
          resp_temperature.sequence_num = tempr_slot_info[s_index].seq_num++;
          resp_temperature.status = M2M2_APP_COMMON_STATUS_OK;
          resp_temperature.nTS = get_sensor_time_stamp();
          tempr_slot_info[s_index].res = gsResistance;
          resp_temperature.nTemperature1 = getTemperature(s_index,lut_index);
          tempr_slot_info[s_index].tempr = resp_temperature.nTemperature1;
          resp_temperature.nTemperature2 = (uint16_t)(gsResistance/100);  /*Resistance measured in 100's of ohms*/
          adi_osal_EnterCriticalRegion();
          lut_index++;
          p_pkt = post_office_create_msg(sizeof(temperature_app_stream_t) + M2M2_HEADER_SZ);
          if(p_pkt != NULL)
          {
#ifdef DEBUG_PKT
            g_temp_pkt_cnt++;
#endif
            p_pkt->src = M2M2_ADDR_MED_TEMPERATURE;
      
            /*for slot D, keep the legacy stream ID*/
            if(s_index == E_THERMISTOR_SLOT_D)
              p_pkt->dest = M2M2_ADDR_MED_TEMPERATURE_STREAM;
            else
              p_pkt->dest = M2M2_ADDR_MED_TEMPERATURE_STREAM1 + s_index;

