ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000_temp/temperature_task.c
            p_pkt->length = M2M2_HEADER_SZ + sizeof(temperature_app_stream_t);
            memcpy(&p_pkt->data[0], &resp_temperature,  sizeof(temperature_app_stream_t));
#ifdef DEBUG_PKT
            post_office_msg_cnt(p_pkt);
#endif
            post_office_send(p_pkt,&err);
            p_pkt = NULL;
          }
          adi_osal_ExitCriticalRegion(); /* exiting critical region even if mem_alloc fails*/
        }
      }
    }
  }
#ifdef USER0_CONFIG_APP
  }
#endif//USER0_CONFIG_APP
}

/*!*******************************************************************************
* \brief      Updates the adpd4k data from Thermistor and cal-resistor slots
*             to the global static array used for computing temperature value
*
* \param[in]  pData : pointer to the 32bit ADPD4K data from a slot
*
* \param[in]  slot_index : indicates the slot to which the data belongs to
*
* \return     None
**********************************************************************************/
void temperatureAppData (uint32_t *pData, uint8_t slot_index) {

  if((active_temperature_lcfg.slots_selected & (1 << slot_index)))
    thermistor_adc_val[slot_index] = *pData;
  /* when the last thermistor's data is read from ADPD4K,trigger temperature app */
  if(slot_index == g_last_thermistor_slot_index)
  {
      if(num_thermistor_samples++ >= gsSlot[E_CAL_RES_SLOT_E].odr * active_temperature_lcfg.sample_period)
      {
          num_thermistor_samples = 0;
          adi_osal_SemPost(temperature_app_task_evt_sem);
      }
  }
}
#endif
#endif//ENABLE_TEMPERATURE_APP